"""
Задание 3 (необязательное).
Итератор FlatIterator для обработки списков с любым уровнем вложенности.
"""
from collections.abc import Iterable


class FlatIterator:
    """
    Итератор для преобразования вложенных итерируемых объектов любого уровня
    в плоскую последовательность.
    Поддерживает list, tuple, set и другие Iterable (кроме строк и байтов).
    """

    def __init__(self, list_of_list):
        self.list_of_list = list_of_list

    def __iter__(self):
        self.stack = [iter(self.list_of_list)]
        return self

    def __next__(self):
        while self.stack:
            try:
                item = next(self.stack[-1])

                if isinstance(item, Iterable) and not isinstance(item, (str, bytes)):
                    self.stack.append(iter(item))
                else:
                    return item
            except StopIteration:
                self.stack.pop()

        raise StopIteration


def test_3():
    """
    Тестовая функция для проверки работы FlatIterator с любым уровнем вложенности.
    """
    list_of_lists_2 = [
        [['a'], ['b', 'c']],
        ['d', 'e', [['f'], 'h'], False],
        [1, 2, None, [[[[['!']]]]], []]
    ]

    for flat_iterator_item, check_item in zip(
        FlatIterator(list_of_lists_2),
        ['a', 'b', 'c', 'd', 'e', 'f', 'h', False, 1, 2, None, '!']
    ):
        assert flat_iterator_item == check_item

    assert list(FlatIterator(list_of_lists_2)) == ['a', 'b', 'c', 'd', 'e', 'f', 'h', False, 1, 2, None, '!']

    # Проверка работы с кортежами, множествами и смешанными структурами
    mixed_data = [
        ('a', 'b'),
        [('c',), ['d', 'e']],
        (1, [2, (3,)]),
    ]

    assert list(FlatIterator(mixed_data)) == ['a', 'b', 'c', 'd', 'e', 1, 2, 3]

    # set не гарантирует порядок, поэтому проверяем через множество
    data_with_set = [
        [1, 2],
        {3, 4},
        [5],
    ]
    result = list(FlatIterator(data_with_set))
    assert set(result) == {1, 2, 3, 4, 5}
    assert len(result) == 5

    print("Тест 3 пройден успешно!")


if __name__ == '__main__':
    test_3()
